Model: "sequential_173"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_150 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_696 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_831 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_697 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_832 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_698 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_833 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_699 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_834 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_173 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_173 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_835 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_519 (Dense)           (None, 128)               65664     
                                                                 
 dense_520 (Dense)           (None, 32)                4128      
                                                                 
 dropout_173 (Dropout)       (None, 32)                0         
                                                                 
 dense_521 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
