Model: "sequential_172"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_149 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_692 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_826 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_693 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_827 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_694 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_828 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_695 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_829 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_172 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_172 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_830 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_516 (Dense)           (None, 128)               65664     
                                                                 
 dense_517 (Dense)           (None, 32)                4128      
                                                                 
 dropout_172 (Dropout)       (None, 32)                0         
                                                                 
 dense_518 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
