Model: "sequential_176"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_153 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_708 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_846 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_709 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_847 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_710 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_848 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_711 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_849 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_176 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_176 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_850 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_528 (Dense)           (None, 128)               65664     
                                                                 
 dense_529 (Dense)           (None, 32)                4128      
                                                                 
 dropout_176 (Dropout)       (None, 32)                0         
                                                                 
 dense_530 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
