Model: "sequential_171"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_148 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_688 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_821 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_689 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_822 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_690 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_823 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_691 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_824 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_171 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_171 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_825 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_513 (Dense)           (None, 128)               65664     
                                                                 
 dense_514 (Dense)           (None, 32)                4128      
                                                                 
 dropout_171 (Dropout)       (None, 32)                0         
                                                                 
 dense_515 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
