Model: "sequential_170"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_147 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_684 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_816 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_685 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_817 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_686 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_818 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_687 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_819 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_170 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_170 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_820 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_510 (Dense)           (None, 128)               65664     
                                                                 
 dense_511 (Dense)           (None, 32)                4128      
                                                                 
 dropout_170 (Dropout)       (None, 32)                0         
                                                                 
 dense_512 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
