Model: "sequential_169"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_146 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_680 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_811 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_681 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_812 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_682 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_813 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_683 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_814 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_169 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_169 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_815 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_507 (Dense)           (None, 128)               65664     
                                                                 
 dense_508 (Dense)           (None, 32)                4128      
                                                                 
 dropout_169 (Dropout)       (None, 32)                0         
                                                                 
 dense_509 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
