Model: "sequential_175"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_152 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_704 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_841 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_705 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_842 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_706 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_843 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_707 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_844 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_175 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_175 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_845 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_525 (Dense)           (None, 128)               65664     
                                                                 
 dense_526 (Dense)           (None, 32)                4128      
                                                                 
 dropout_175 (Dropout)       (None, 32)                0         
                                                                 
 dense_527 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
