Model: "sequential_74"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_51 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_300 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_336 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_301 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_337 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_302 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_338 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_303 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_339 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_74 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_74 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_340 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_222 (Dense)           (None, 128)               53376     
                                                                 
 dense_223 (Dense)           (None, 32)                4128      
                                                                 
 dropout_74 (Dropout)        (None, 32)                0         
                                                                 
 dense_224 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
