Model: "sequential_78"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_55 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_316 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_356 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_317 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_357 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_318 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_358 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_319 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_359 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_78 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_78 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_360 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_234 (Dense)           (None, 128)               53376     
                                                                 
 dense_235 (Dense)           (None, 32)                4128      
                                                                 
 dropout_78 (Dropout)        (None, 32)                0         
                                                                 
 dense_236 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
