Model: "sequential_84"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_61 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_340 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_386 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_341 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_387 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_342 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_388 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_343 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_389 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_84 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_84 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_390 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_252 (Dense)           (None, 128)               53376     
                                                                 
 dense_253 (Dense)           (None, 32)                4128      
                                                                 
 dropout_84 (Dropout)        (None, 32)                0         
                                                                 
 dense_254 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
