Model: "sequential_102"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_79 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_412 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_476 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_413 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_477 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_414 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_478 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_415 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_479 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_102 (Conv1D)         (None, 13, 32)            10272     
                                                                 
 flatten_102 (Flatten)       (None, 416)               0         
                                                                 
 batch_normalization_480 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_306 (Dense)           (None, 128)               53376     
                                                                 
 dense_307 (Dense)           (None, 32)                4128      
                                                                 
 dropout_102 (Dropout)       (None, 32)                0         
                                                                 
 dense_308 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
