Model: "sequential_68"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_45 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_276 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_306 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_277 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_307 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_278 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_308 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_279 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_309 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_68 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_68 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_310 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_204 (Dense)           (None, 128)               53376     
                                                                 
 dense_205 (Dense)           (None, 32)                4128      
                                                                 
 dropout_68 (Dropout)        (None, 32)                0         
                                                                 
 dense_206 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
