Model: "sequential_73"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_50 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_296 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_331 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_297 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_332 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_298 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_333 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_299 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_334 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_73 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_73 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_335 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_219 (Dense)           (None, 128)               53376     
                                                                 
 dense_220 (Dense)           (None, 32)                4128      
                                                                 
 dropout_73 (Dropout)        (None, 32)                0         
                                                                 
 dense_221 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
