Model: "sequential_71"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_48 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_288 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_321 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_289 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_322 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_290 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_323 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_291 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_324 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_71 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_71 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_325 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_213 (Dense)           (None, 128)               53376     
                                                                 
 dense_214 (Dense)           (None, 32)                4128      
                                                                 
 dropout_71 (Dropout)        (None, 32)                0         
                                                                 
 dense_215 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
