Model: "sequential_85"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_62 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_344 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_391 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_345 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_392 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_346 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_393 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_347 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_394 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_85 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_85 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_395 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_255 (Dense)           (None, 128)               53376     
                                                                 
 dense_256 (Dense)           (None, 32)                4128      
                                                                 
 dropout_85 (Dropout)        (None, 32)                0         
                                                                 
 dense_257 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
