Model: "sequential_96"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_73 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_388 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_446 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_389 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_447 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_390 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_448 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_391 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_449 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_96 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_96 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_450 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_288 (Dense)           (None, 128)               53376     
                                                                 
 dense_289 (Dense)           (None, 32)                4128      
                                                                 
 dropout_96 (Dropout)        (None, 32)                0         
                                                                 
 dense_290 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
