Model: "sequential_98"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_75 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_396 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_456 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_397 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_457 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_398 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_458 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_399 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_459 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_98 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_98 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_460 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_294 (Dense)           (None, 128)               53376     
                                                                 
 dense_295 (Dense)           (None, 32)                4128      
                                                                 
 dropout_98 (Dropout)        (None, 32)                0         
                                                                 
 dense_296 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
