Model: "sequential_80"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_57 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_324 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_366 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_325 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_367 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_326 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_368 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_327 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_369 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_80 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_80 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_370 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_240 (Dense)           (None, 128)               53376     
                                                                 
 dense_241 (Dense)           (None, 32)                4128      
                                                                 
 dropout_80 (Dropout)        (None, 32)                0         
                                                                 
 dense_242 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
