Model: "sequential_14"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 separable_conv1d_84 (Separa  (None, 2048, 64)         21504     
 bleConv1D)                                                      
                                                                 
 max_pooling1d_84 (MaxPoolin  (None, 1024, 64)         0         
 g1D)                                                            
                                                                 
 batch_normalization_95 (Bat  (None, 1024, 64)         256       
 chNormalization)                                                
                                                                 
 separable_conv1d_85 (Separa  (None, 1024, 64)         274496    
 bleConv1D)                                                      
                                                                 
 max_pooling1d_85 (MaxPoolin  (None, 512, 64)          0         
 g1D)                                                            
                                                                 
 batch_normalization_96 (Bat  (None, 512, 64)          256       
 chNormalization)                                                
                                                                 
 separable_conv1d_86 (Separa  (None, 512, 128)         1073280   
 bleConv1D)                                                      
                                                                 
 max_pooling1d_86 (MaxPoolin  (None, 256, 128)         0         
 g1D)                                                            
                                                                 
 batch_normalization_97 (Bat  (None, 256, 128)         512       
 chNormalization)                                                
                                                                 
 separable_conv1d_87 (Separa  (None, 256, 128)         2146432   
 bleConv1D)                                                      
                                                                 
 max_pooling1d_87 (MaxPoolin  (None, 128, 128)         0         
 g1D)                                                            
                                                                 
 batch_normalization_98 (Bat  (None, 128, 128)         512       
 chNormalization)                                                
                                                                 
 separable_conv1d_88 (Separa  (None, 128, 32)          143392    
 bleConv1D)                                                      
                                                                 
 max_pooling1d_88 (MaxPoolin  (None, 64, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_99 (Bat  (None, 64, 32)           128       
 chNormalization)                                                
                                                                 
 separable_conv1d_89 (Separa  (None, 64, 32)           35872     
 bleConv1D)                                                      
                                                                 
 max_pooling1d_89 (MaxPoolin  (None, 32, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_100 (Ba  (None, 32, 32)           128       
 tchNormalization)                                               
                                                                 
 conv1d_14 (Conv1D)          (None, 16, 32)            3104      
                                                                 
 batch_normalization_101 (Ba  (None, 16, 32)           128       
 tchNormalization)                                               
                                                                 
 flatten_14 (Flatten)        (None, 512)               0         
                                                                 
 dense_42 (Dense)            (None, 128)               65664     
                                                                 
 dense_43 (Dense)            (None, 32)                4128      
                                                                 
 dropout_14 (Dropout)        (None, 32)                0         
                                                                 
 dense_44 (Dense)            (None, 1)                 33        
                                                                 
=================================================================
Total params: 3,769,825
Trainable params: 3,768,865
Non-trainable params: 960
_________________________________________________________________
