Model: "sequential_81"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_58 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_328 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_371 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_329 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_372 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_330 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_373 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_331 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_374 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_81 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_81 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_375 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_243 (Dense)           (None, 128)               53376     
                                                                 
 dense_244 (Dense)           (None, 32)                4128      
                                                                 
 dropout_81 (Dropout)        (None, 32)                0         
                                                                 
 dense_245 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
