Model: "sequential_22"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_7 (Spatia  (None, 100, 5)           0         
 lDropout1D)                                                     
                                                                 
 separable_conv1d_126 (Separ  (None, 100, 64)          21504     
 ableConv1D)                                                     
                                                                 
 batch_normalization_143 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_127 (Separ  (None, 100, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_144 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_128 (Separ  (None, 100, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_145 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 conv1d_22 (Conv1D)          (None, 17, 32)            18464     
                                                                 
 flatten_22 (Flatten)        (None, 544)               0         
                                                                 
 dense_66 (Dense)            (None, 128)               69760     
                                                                 
 dense_67 (Dense)            (None, 32)                4128      
                                                                 
 dropout_22 (Dropout)        (None, 32)                0         
                                                                 
 dense_68 (Dense)            (None, 1)                 33        
                                                                 
=================================================================
Total params: 663,649
Trainable params: 663,265
Non-trainable params: 384
_________________________________________________________________
