Model: "sequential_82"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_59 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_332 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_376 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_333 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_377 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_334 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_378 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_335 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_379 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_82 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_82 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_380 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_246 (Dense)           (None, 128)               53376     
                                                                 
 dense_247 (Dense)           (None, 32)                4128      
                                                                 
 dropout_82 (Dropout)        (None, 32)                0         
                                                                 
 dense_248 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
