Model: "sequential_76"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_53 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_308 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_346 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_309 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_347 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_310 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_348 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_311 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_349 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_76 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_76 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_350 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_228 (Dense)           (None, 128)               53376     
                                                                 
 dense_229 (Dense)           (None, 32)                4128      
                                                                 
 dropout_76 (Dropout)        (None, 32)                0         
                                                                 
 dense_230 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
