Model: "sequential_97"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_74 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_392 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_451 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_393 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_452 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_394 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_453 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_395 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_454 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_97 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_97 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_455 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_291 (Dense)           (None, 128)               53376     
                                                                 
 dense_292 (Dense)           (None, 32)                4128      
                                                                 
 dropout_97 (Dropout)        (None, 32)                0         
                                                                 
 dense_293 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
