Model: "sequential_100"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_77 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_404 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_466 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_405 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_467 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_406 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_468 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_407 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_469 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_100 (Conv1D)         (None, 13, 32)            10272     
                                                                 
 flatten_100 (Flatten)       (None, 416)               0         
                                                                 
 batch_normalization_470 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_300 (Dense)           (None, 128)               53376     
                                                                 
 dense_301 (Dense)           (None, 32)                4128      
                                                                 
 dropout_100 (Dropout)       (None, 32)                0         
                                                                 
 dense_302 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
