Model: "sequential_104"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_81 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_420 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_486 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_421 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_487 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_422 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_488 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_423 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_489 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_104 (Conv1D)         (None, 13, 32)            10272     
                                                                 
 flatten_104 (Flatten)       (None, 416)               0         
                                                                 
 batch_normalization_490 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_312 (Dense)           (None, 128)               53376     
                                                                 
 dense_313 (Dense)           (None, 32)                4128      
                                                                 
 dropout_104 (Dropout)       (None, 32)                0         
                                                                 
 dense_314 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
