Model: "sequential_33"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_10 (Spati  (None, 100, 5)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_157 (Separ  (None, 100, 64)          21504     
 ableConv1D)                                                     
                                                                 
 conv1d_33 (Conv1D)          (None, 50, 32)            10272     
                                                                 
 flatten_33 (Flatten)        (None, 1600)              0         
                                                                 
 layer_normalization_1 (Laye  (None, 1600)             3200      
 rNormalization)                                                 
                                                                 
 dense_99 (Dense)            (None, 128)               204928    
                                                                 
 dense_100 (Dense)           (None, 32)                4128      
                                                                 
 dropout_33 (Dropout)        (None, 32)                0         
                                                                 
 dense_101 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 244,065
Trainable params: 244,065
Non-trainable params: 0
_________________________________________________________________
