Model: "sequential_21"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_6 (Spatia  (None, 100, 5)           0         
 lDropout1D)                                                     
                                                                 
 separable_conv1d_123 (Separ  (None, 100, 64)          21504     
 ableConv1D)                                                     
                                                                 
 batch_normalization_140 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_124 (Separ  (None, 100, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_141 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_125 (Separ  (None, 100, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_142 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 conv1d_21 (Conv1D)          (None, 17, 32)            18464     
                                                                 
 flatten_21 (Flatten)        (None, 544)               0         
                                                                 
 dense_63 (Dense)            (None, 128)               69760     
                                                                 
 dense_64 (Dense)            (None, 32)                4128      
                                                                 
 dropout_21 (Dropout)        (None, 32)                0         
                                                                 
 dense_65 (Dense)            (None, 1)                 33        
                                                                 
=================================================================
Total params: 663,649
Trainable params: 663,265
Non-trainable params: 384
_________________________________________________________________
