Model: "sequential_70"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_47 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_284 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_316 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_285 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_317 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_286 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_318 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_287 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_319 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_70 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_70 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_320 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_210 (Dense)           (None, 128)               53376     
                                                                 
 dense_211 (Dense)           (None, 32)                4128      
                                                                 
 dropout_70 (Dropout)        (None, 32)                0         
                                                                 
 dense_212 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
