Model: "sequential_69"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_46 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_280 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_311 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_281 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_312 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_282 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_313 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_283 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_314 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_69 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_69 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_315 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_207 (Dense)           (None, 128)               53376     
                                                                 
 dense_208 (Dense)           (None, 32)                4128      
                                                                 
 dropout_69 (Dropout)        (None, 32)                0         
                                                                 
 dense_209 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
