Model: "sequential_77"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_54 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_312 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_351 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_313 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_352 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_314 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_353 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_315 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_354 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_77 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_77 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_355 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_231 (Dense)           (None, 128)               53376     
                                                                 
 dense_232 (Dense)           (None, 32)                4128      
                                                                 
 dropout_77 (Dropout)        (None, 32)                0         
                                                                 
 dense_233 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
