Model: "sequential_99"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_76 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_400 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_461 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_401 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_462 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_402 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_463 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_403 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_464 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_99 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_99 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_465 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_297 (Dense)           (None, 128)               53376     
                                                                 
 dense_298 (Dense)           (None, 32)                4128      
                                                                 
 dropout_99 (Dropout)        (None, 32)                0         
                                                                 
 dense_299 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
