Model: "sequential_36"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_13 (Spati  (None, 100, 5)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_160 (Separ  (None, 100, 64)          42944     
 ableConv1D)                                                     
                                                                 
 batch_normalization_165 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 conv1d_36 (Conv1D)          (None, 50, 32)            10272     
                                                                 
 flatten_36 (Flatten)        (None, 1600)              0         
                                                                 
 layer_normalization_4 (Laye  (None, 1600)             3200      
 rNormalization)                                                 
                                                                 
 dense_108 (Dense)           (None, 128)               204928    
                                                                 
 dense_109 (Dense)           (None, 32)                4128      
                                                                 
 dropout_36 (Dropout)        (None, 32)                0         
                                                                 
 dense_110 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 265,761
Trainable params: 265,633
Non-trainable params: 128
_________________________________________________________________
