Model: "sequential_40"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_17 (Spati  (None, 100, 5)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_164 (Separ  (None, 100, 64)          21504     
 ableConv1D)                                                     
                                                                 
 batch_normalization_169 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_120 (MaxPooli  (None, 50, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_165 (Separ  (None, 50, 64)           548928    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_121 (MaxPooli  (None, 25, 64)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_170 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_40 (Conv1D)          (None, 13, 32)            6176      
                                                                 
 batch_normalization_171 (Ba  (None, 13, 32)           128       
 tchNormalization)                                               
                                                                 
 flatten_40 (Flatten)        (None, 416)               0         
                                                                 
 dense_120 (Dense)           (None, 128)               53376     
                                                                 
 dense_121 (Dense)           (None, 32)                4128      
                                                                 
 dropout_40 (Dropout)        (None, 32)                0         
                                                                 
 dense_122 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 634,785
Trainable params: 634,465
Non-trainable params: 320
_________________________________________________________________
