Model: "sequential_72"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_49 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_292 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_326 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_293 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_327 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_294 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_328 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_295 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_329 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_72 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_72 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_330 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_216 (Dense)           (None, 128)               53376     
                                                                 
 dense_217 (Dense)           (None, 32)                4128      
                                                                 
 dropout_72 (Dropout)        (None, 32)                0         
                                                                 
 dense_218 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
