Model: "sequential_46"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_23 (Spati  (None, 100, 5)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_179 (Separ  (None, 100, 64)          21504     
 ableConv1D)                                                     
                                                                 
 batch_normalization_190 (Ba  (None, 100, 64)          256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_135 (MaxPooli  (None, 50, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_180 (Separ  (None, 50, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_191 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_136 (MaxPooli  (None, 25, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_181 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_137 (MaxPooli  (None, 13, 64)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_192 (Ba  (None, 13, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_182 (Separ  (None, 13, 32)           71712     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_138 (MaxPooli  (None, 7, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_193 (Ba  (None, 7, 32)            128       
 tchNormalization)                                               
                                                                 
 separable_conv1d_183 (Separ  (None, 7, 32)            35872     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_139 (MaxPooli  (None, 4, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_194 (Ba  (None, 4, 32)            128       
 tchNormalization)                                               
                                                                 
 conv1d_46 (Conv1D)          (None, 2, 32)             3104      
                                                                 
 batch_normalization_195 (Ba  (None, 2, 32)            128       
 tchNormalization)                                               
                                                                 
 flatten_46 (Flatten)        (None, 64)                0         
                                                                 
 dense_138 (Dense)           (None, 128)               8320      
                                                                 
 dense_139 (Dense)           (None, 32)                4128      
                                                                 
 dropout_46 (Dropout)        (None, 32)                0         
                                                                 
 dense_140 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 694,817
Trainable params: 694,241
Non-trainable params: 576
_________________________________________________________________
