Model: "sequential_79"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_56 (Spati  (None, 100, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_320 (Separ  (None, 50, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_361 (Ba  (None, 50, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_321 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_362 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_322 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_363 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_323 (Separ  (None, 25, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_364 (Ba  (None, 25, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_79 (Conv1D)          (None, 13, 32)            10272     
                                                                 
 flatten_79 (Flatten)        (None, 416)               0         
                                                                 
 batch_normalization_365 (Ba  (None, 416)              1664      
 tchNormalization)                                               
                                                                 
 dense_237 (Dense)           (None, 128)               53376     
                                                                 
 dense_238 (Dense)           (None, 32)                4128      
                                                                 
 dropout_79 (Dropout)        (None, 32)                0         
                                                                 
 dense_239 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 988,385
Trainable params: 987,041
Non-trainable params: 1,344
_________________________________________________________________
