Model: "sequential_166"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_143 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_668 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_796 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_669 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_797 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_670 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_798 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_671 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_799 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_166 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_166 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_800 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_498 (Dense)           (None, 128)               65664     
                                                                 
 dense_499 (Dense)           (None, 32)                4128      
                                                                 
 dropout_166 (Dropout)       (None, 32)                0         
                                                                 
 dense_500 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
