Model: "sequential_160"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_137 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_644 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_766 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_645 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_767 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_646 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_768 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_647 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_769 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_160 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_160 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_770 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_480 (Dense)           (None, 128)               65664     
                                                                 
 dense_481 (Dense)           (None, 32)                4128      
                                                                 
 dropout_160 (Dropout)       (None, 32)                0         
                                                                 
 dense_482 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
