Model: "sequential_167"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_144 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_672 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_801 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_673 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_802 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_674 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_803 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_675 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_804 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_167 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_167 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_805 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_501 (Dense)           (None, 128)               65664     
                                                                 
 dense_502 (Dense)           (None, 32)                4128      
                                                                 
 dropout_167 (Dropout)       (None, 32)                0         
                                                                 
 dense_503 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
