Model: "sequential_164"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_141 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_660 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_786 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_661 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_787 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_662 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_788 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_663 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_789 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_164 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_164 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_790 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_492 (Dense)           (None, 128)               65664     
                                                                 
 dense_493 (Dense)           (None, 32)                4128      
                                                                 
 dropout_164 (Dropout)       (None, 32)                0         
                                                                 
 dense_494 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
