Model: "sequential_163"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_140 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_656 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_781 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_657 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_782 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_658 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_783 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_659 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_784 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_163 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_163 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_785 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_489 (Dense)           (None, 128)               65664     
                                                                 
 dense_490 (Dense)           (None, 32)                4128      
                                                                 
 dropout_163 (Dropout)       (None, 32)                0         
                                                                 
 dense_491 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
