Model: "sequential_162"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_139 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_652 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_776 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_653 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_777 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_654 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_778 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_655 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_779 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_162 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_162 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_780 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_486 (Dense)           (None, 128)               65664     
                                                                 
 dense_487 (Dense)           (None, 32)                4128      
                                                                 
 dropout_162 (Dropout)       (None, 32)                0         
                                                                 
 dense_488 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
