Model: "sequential_1"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 separable_conv1d_6 (Separab  (None, 2048, 64)         21504     
 leConv1D)                                                       
                                                                 
 max_pooling1d_6 (MaxPooling  (None, 1024, 64)         0         
 1D)                                                             
                                                                 
 batch_normalization_4 (Batc  (None, 1024, 64)         256       
 hNormalization)                                                 
                                                                 
 separable_conv1d_7 (Separab  (None, 1024, 64)         274496    
 leConv1D)                                                       
                                                                 
 max_pooling1d_7 (MaxPooling  (None, 512, 64)          0         
 1D)                                                             
                                                                 
 batch_normalization_5 (Batc  (None, 512, 64)          256       
 hNormalization)                                                 
                                                                 
 separable_conv1d_8 (Separab  (None, 512, 128)         1073280   
 leConv1D)                                                       
                                                                 
 max_pooling1d_8 (MaxPooling  (None, 256, 128)         0         
 1D)                                                             
                                                                 
 batch_normalization_6 (Batc  (None, 256, 128)         512       
 hNormalization)                                                 
                                                                 
 separable_conv1d_9 (Separab  (None, 256, 128)         2146432   
 leConv1D)                                                       
                                                                 
 max_pooling1d_9 (MaxPooling  (None, 128, 128)         0         
 1D)                                                             
                                                                 
 batch_normalization_7 (Batc  (None, 128, 128)         512       
 hNormalization)                                                 
                                                                 
 separable_conv1d_10 (Separa  (None, 128, 32)          143392    
 bleConv1D)                                                      
                                                                 
 max_pooling1d_10 (MaxPoolin  (None, 64, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_8 (Batc  (None, 64, 32)           128       
 hNormalization)                                                 
                                                                 
 separable_conv1d_11 (Separa  (None, 64, 32)           35872     
 bleConv1D)                                                      
                                                                 
 max_pooling1d_11 (MaxPoolin  (None, 32, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_9 (Batc  (None, 32, 32)           128       
 hNormalization)                                                 
                                                                 
 conv1d_1 (Conv1D)           (None, 16, 32)            3104      
                                                                 
 batch_normalization_10 (Bat  (None, 16, 32)           128       
 chNormalization)                                                
                                                                 
 flatten_1 (Flatten)         (None, 512)               0         
                                                                 
 dense_3 (Dense)             (None, 128)               65664     
                                                                 
 dense_4 (Dense)             (None, 32)                4128      
                                                                 
 dropout_1 (Dropout)         (None, 32)                0         
                                                                 
 dense_5 (Dense)             (None, 1)                 33        
                                                                 
=================================================================
Total params: 3,769,825
Trainable params: 3,768,865
Non-trainable params: 960
_________________________________________________________________
