Model: "sequential_126"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_103 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_508 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_596 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_509 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_597 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_510 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_598 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_511 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_599 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_126 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_126 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_600 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_378 (Dense)           (None, 128)               65664     
                                                                 
 dense_379 (Dense)           (None, 32)                4128      
                                                                 
 dropout_126 (Dropout)       (None, 32)                0         
                                                                 
 dense_380 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
