Model: "sequential_130"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_107 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_524 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_616 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_525 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_617 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_526 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_618 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_527 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_619 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_130 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_130 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_620 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_390 (Dense)           (None, 128)               65664     
                                                                 
 dense_391 (Dense)           (None, 32)                4128      
                                                                 
 dropout_130 (Dropout)       (None, 32)                0         
                                                                 
 dense_392 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
