Model: "sequential_127"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_104 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_512 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_601 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_513 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_602 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_514 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_603 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_515 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_604 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_127 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_127 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_605 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_381 (Dense)           (None, 128)               65664     
                                                                 
 dense_382 (Dense)           (None, 32)                4128      
                                                                 
 dropout_127 (Dropout)       (None, 32)                0         
                                                                 
 dense_383 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
