Model: "sequential_129"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_106 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_520 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_611 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_521 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_612 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_522 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_613 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_523 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_614 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_129 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_129 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_615 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_387 (Dense)           (None, 128)               65664     
                                                                 
 dense_388 (Dense)           (None, 32)                4128      
                                                                 
 dropout_129 (Dropout)       (None, 32)                0         
                                                                 
 dense_389 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
