Model: "sequential_34"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_11 (Spati  (None, 125, 5)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_158 (Separ  (None, 125, 64)          21504     
 ableConv1D)                                                     
                                                                 
 conv1d_34 (Conv1D)          (None, 63, 32)            10272     
                                                                 
 flatten_34 (Flatten)        (None, 2016)              0         
                                                                 
 layer_normalization_2 (Laye  (None, 2016)             4032      
 rNormalization)                                                 
                                                                 
 dense_102 (Dense)           (None, 128)               258176    
                                                                 
 dense_103 (Dense)           (None, 32)                4128      
                                                                 
 dropout_34 (Dropout)        (None, 32)                0         
                                                                 
 dense_104 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 298,145
Trainable params: 298,145
Non-trainable params: 0
_________________________________________________________________
