Model: "sequential_18"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_3 (Spatia  (None, 2048, 5)          0         
 lDropout1D)                                                     
                                                                 
 separable_conv1d_108 (Separ  (None, 2048, 64)         21504     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_108 (MaxPooli  (None, 1024, 64)         0         
 ng1D)                                                           
                                                                 
 batch_normalization_123 (Ba  (None, 1024, 64)         256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_109 (Separ  (None, 1024, 64)         274496    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_109 (MaxPooli  (None, 512, 64)          0         
 ng1D)                                                           
                                                                 
 batch_normalization_124 (Ba  (None, 512, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_110 (Separ  (None, 512, 128)         1073280   
 ableConv1D)                                                     
                                                                 
 max_pooling1d_110 (MaxPooli  (None, 256, 128)         0         
 ng1D)                                                           
                                                                 
 batch_normalization_125 (Ba  (None, 256, 128)         512       
 tchNormalization)                                               
                                                                 
 separable_conv1d_111 (Separ  (None, 256, 128)         2146432   
 ableConv1D)                                                     
                                                                 
 max_pooling1d_111 (MaxPooli  (None, 128, 128)         0         
 ng1D)                                                           
                                                                 
 batch_normalization_126 (Ba  (None, 128, 128)         512       
 tchNormalization)                                               
                                                                 
 separable_conv1d_112 (Separ  (None, 128, 32)          143392    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_112 (MaxPooli  (None, 64, 32)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_127 (Ba  (None, 64, 32)           128       
 tchNormalization)                                               
                                                                 
 separable_conv1d_113 (Separ  (None, 64, 32)           35872     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_113 (MaxPooli  (None, 32, 32)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_128 (Ba  (None, 32, 32)           128       
 tchNormalization)                                               
                                                                 
 conv1d_18 (Conv1D)          (None, 16, 32)            3104      
                                                                 
 batch_normalization_129 (Ba  (None, 16, 32)           128       
 tchNormalization)                                               
                                                                 
 flatten_18 (Flatten)        (None, 512)               0         
                                                                 
 dense_54 (Dense)            (None, 128)               65664     
                                                                 
 dense_55 (Dense)            (None, 32)                4128      
                                                                 
 dropout_18 (Dropout)        (None, 32)                0         
                                                                 
 dense_56 (Dense)            (None, 1)                 33        
                                                                 
=================================================================
Total params: 3,769,825
Trainable params: 3,768,865
Non-trainable params: 960
_________________________________________________________________
