Model: "sequential_53"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_30 (Spati  (None, 125, 1)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_207 (Separ  (None, 125, 64)          4352      
 ableConv1D)                                                     
                                                                 
 batch_normalization_224 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_150 (MaxPooli  (None, 63, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_208 (Separ  (None, 63, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_225 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_151 (MaxPooli  (None, 32, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_209 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_152 (MaxPooli  (None, 16, 64)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_226 (Ba  (None, 16, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_210 (Separ  (None, 16, 32)           71712     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_153 (MaxPooli  (None, 8, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_227 (Ba  (None, 8, 32)            128       
 tchNormalization)                                               
                                                                 
 separable_conv1d_211 (Separ  (None, 8, 32)            35872     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_154 (MaxPooli  (None, 4, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_228 (Ba  (None, 4, 32)            128       
 tchNormalization)                                               
                                                                 
 conv1d_53 (Conv1D)          (None, 2, 32)             3104      
                                                                 
 batch_normalization_229 (Ba  (None, 2, 32)            128       
 tchNormalization)                                               
                                                                 
 flatten_53 (Flatten)        (None, 64)                0         
                                                                 
 dense_159 (Dense)           (None, 128)               8320      
                                                                 
 dense_160 (Dense)           (None, 32)                4128      
                                                                 
 dropout_53 (Dropout)        (None, 32)                0         
                                                                 
 dense_161 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 677,665
Trainable params: 677,089
Non-trainable params: 576
_________________________________________________________________
