Model: "sequential_55"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_32 (Spati  (None, 125, 1)           0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_217 (Separ  (None, 125, 64)          4352      
 ableConv1D)                                                     
                                                                 
 batch_normalization_236 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_160 (MaxPooli  (None, 63, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_218 (Separ  (None, 63, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_237 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 max_pooling1d_161 (MaxPooli  (None, 32, 64)           0         
 ng1D)                                                           
                                                                 
 separable_conv1d_219 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 max_pooling1d_162 (MaxPooli  (None, 16, 64)           0         
 ng1D)                                                           
                                                                 
 batch_normalization_238 (Ba  (None, 16, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_220 (Separ  (None, 16, 32)           71712     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_163 (MaxPooli  (None, 8, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_239 (Ba  (None, 8, 32)            128       
 tchNormalization)                                               
                                                                 
 separable_conv1d_221 (Separ  (None, 8, 32)            35872     
 ableConv1D)                                                     
                                                                 
 max_pooling1d_164 (MaxPooli  (None, 4, 32)            0         
 ng1D)                                                           
                                                                 
 batch_normalization_240 (Ba  (None, 4, 32)            128       
 tchNormalization)                                               
                                                                 
 conv1d_55 (Conv1D)          (None, 2, 32)             3104      
                                                                 
 batch_normalization_241 (Ba  (None, 2, 32)            128       
 tchNormalization)                                               
                                                                 
 flatten_55 (Flatten)        (None, 64)                0         
                                                                 
 dense_165 (Dense)           (None, 128)               8320      
                                                                 
 dense_166 (Dense)           (None, 32)                4128      
                                                                 
 dropout_55 (Dropout)        (None, 32)                0         
                                                                 
 dense_167 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 677,665
Trainable params: 677,089
Non-trainable params: 576
_________________________________________________________________
