Model: "sequential_115"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_92 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_464 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_541 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_465 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_542 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_466 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_543 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_467 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_544 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_115 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_115 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_545 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_345 (Dense)           (None, 128)               65664     
                                                                 
 dense_346 (Dense)           (None, 32)                4128      
                                                                 
 dropout_115 (Dropout)       (None, 32)                0         
                                                                 
 dense_347 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
