Model: "sequential_119"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_96 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_480 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_561 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_481 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_562 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_482 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_563 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_483 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_564 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_119 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_119 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_565 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_357 (Dense)           (None, 128)               65664     
                                                                 
 dense_358 (Dense)           (None, 32)                4128      
                                                                 
 dropout_119 (Dropout)       (None, 32)                0         
                                                                 
 dense_359 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
