Model: "sequential_112"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_89 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_452 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_526 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_453 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_527 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_454 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_528 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_455 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_529 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_112 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_112 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_530 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_336 (Dense)           (None, 128)               65664     
                                                                 
 dense_337 (Dense)           (None, 32)                4128      
                                                                 
 dropout_112 (Dropout)       (None, 32)                0         
                                                                 
 dense_338 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
