Model: "sequential_121"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_98 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_488 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_571 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_489 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_572 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_490 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_573 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_491 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_574 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_121 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_121 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_575 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_363 (Dense)           (None, 128)               65664     
                                                                 
 dense_364 (Dense)           (None, 32)                4128      
                                                                 
 dropout_121 (Dropout)       (None, 32)                0         
                                                                 
 dense_365 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
