Model: "sequential_108"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_85 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_436 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_506 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_437 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_507 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_438 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_508 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_439 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_509 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_108 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_108 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_510 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_324 (Dense)           (None, 128)               65664     
                                                                 
 dense_325 (Dense)           (None, 32)                4128      
                                                                 
 dropout_108 (Dropout)       (None, 32)                0         
                                                                 
 dense_326 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
