Model: "sequential_110"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_87 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_444 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_516 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_445 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_517 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_446 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_518 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_447 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_519 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_110 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_110 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_520 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_330 (Dense)           (None, 128)               65664     
                                                                 
 dense_331 (Dense)           (None, 32)                4128      
                                                                 
 dropout_110 (Dropout)       (None, 32)                0         
                                                                 
 dense_332 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
