Model: "sequential_109"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_86 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_440 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_511 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_441 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_512 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_442 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_513 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_443 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_514 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_109 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_109 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_515 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_327 (Dense)           (None, 128)               65664     
                                                                 
 dense_328 (Dense)           (None, 32)                4128      
                                                                 
 dropout_109 (Dropout)       (None, 32)                0         
                                                                 
 dense_329 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
