Model: "sequential_116"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_93 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_468 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_546 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_469 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_547 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_470 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_548 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_471 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_549 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_116 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_116 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_550 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_348 (Dense)           (None, 128)               65664     
                                                                 
 dense_349 (Dense)           (None, 32)                4128      
                                                                 
 dropout_116 (Dropout)       (None, 32)                0         
                                                                 
 dense_350 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
