Model: "sequential_66"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_43 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_268 (Separ  (None, 125, 64)          94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_296 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_269 (Separ  (None, 125, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_297 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_270 (Separ  (None, 125, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_298 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_271 (Separ  (None, 125, 64)          274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_299 (Ba  (None, 125, 64)          256       
 tchNormalization)                                               
                                                                 
 conv1d_66 (Conv1D)          (None, 63, 32)            10272     
                                                                 
 flatten_66 (Flatten)        (None, 2016)              0         
                                                                 
 batch_normalization_300 (Ba  (None, 2016)             8064      
 tchNormalization)                                               
                                                                 
 dense_198 (Dense)           (None, 128)               258176    
                                                                 
 dense_199 (Dense)           (None, 32)                4128      
                                                                 
 dropout_66 (Dropout)        (None, 32)                0         
                                                                 
 dense_200 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,199,585
Trainable params: 1,195,041
Non-trainable params: 4,544
_________________________________________________________________
