Model: "sequential_107"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_84 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_432 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_501 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_433 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_502 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_434 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_503 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_435 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_504 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_107 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_107 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_505 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_321 (Dense)           (None, 128)               65664     
                                                                 
 dense_322 (Dense)           (None, 32)                4128      
                                                                 
 dropout_107 (Dropout)       (None, 32)                0         
                                                                 
 dense_323 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
