Model: "sequential_105"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_82 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_424 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_491 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_425 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_492 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_426 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_493 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_427 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_494 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_105 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_105 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_495 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_315 (Dense)           (None, 128)               65664     
                                                                 
 dense_316 (Dense)           (None, 32)                4128      
                                                                 
 dropout_105 (Dropout)       (None, 32)                0         
                                                                 
 dense_317 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
