Model: "sequential_106"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_83 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_428 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_496 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_429 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_497 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_430 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_498 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_431 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_499 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_106 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_106 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_500 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_318 (Dense)           (None, 128)               65664     
                                                                 
 dense_319 (Dense)           (None, 32)                4128      
                                                                 
 dropout_106 (Dropout)       (None, 32)                0         
                                                                 
 dense_320 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
