Model: "sequential_120"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_97 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_484 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_566 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_485 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_567 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_486 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_568 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_487 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_569 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_120 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_120 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_570 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_360 (Dense)           (None, 128)               65664     
                                                                 
 dense_361 (Dense)           (None, 32)                4128      
                                                                 
 dropout_120 (Dropout)       (None, 32)                0         
                                                                 
 dense_362 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
