Model: "sequential_117"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_94 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_472 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_551 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_473 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_552 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_474 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_553 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_475 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_554 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_117 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_117 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_555 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_351 (Dense)           (None, 128)               65664     
                                                                 
 dense_352 (Dense)           (None, 32)                4128      
                                                                 
 dropout_117 (Dropout)       (None, 32)                0         
                                                                 
 dense_353 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
