Model: "sequential_118"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_95 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_476 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_556 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_477 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_557 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_478 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_558 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_479 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_559 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_118 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_118 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_560 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_354 (Dense)           (None, 128)               65664     
                                                                 
 dense_355 (Dense)           (None, 32)                4128      
                                                                 
 dropout_118 (Dropout)       (None, 32)                0         
                                                                 
 dense_356 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
