Model: "sequential_111"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_88 (Spati  (None, 125, 22)          0         
 alDropout1D)                                                    
                                                                 
 separable_conv1d_448 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_521 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_449 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_522 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_450 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_523 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_451 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_524 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_111 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_111 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_525 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_333 (Dense)           (None, 128)               65664     
                                                                 
 dense_334 (Dense)           (None, 32)                4128      
                                                                 
 dropout_111 (Dropout)       (None, 32)                0         
                                                                 
 dense_335 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
