Model: "sequential_191"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_168 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_768 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_921 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_769 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_922 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_770 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_923 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_771 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_924 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_191 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_191 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_925 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_573 (Dense)           (None, 128)               65664     
                                                                 
 dense_574 (Dense)           (None, 32)                4128      
                                                                 
 dropout_191 (Dropout)       (None, 32)                0         
                                                                 
 dense_575 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
