Model: "sequential_192"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_169 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_772 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_926 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_773 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_927 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_774 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_928 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_775 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_929 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_192 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_192 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_930 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_576 (Dense)           (None, 128)               65664     
                                                                 
 dense_577 (Dense)           (None, 32)                4128      
                                                                 
 dropout_192 (Dropout)       (None, 32)                0         
                                                                 
 dense_578 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
