Model: "sequential_188"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_165 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_756 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_906 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_757 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_907 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_758 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_908 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_759 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_909 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_188 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_188 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_910 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_564 (Dense)           (None, 128)               65664     
                                                                 
 dense_565 (Dense)           (None, 32)                4128      
                                                                 
 dropout_188 (Dropout)       (None, 32)                0         
                                                                 
 dense_566 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
