Model: "sequential_193"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_170 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_776 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_931 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_777 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_932 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_778 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_933 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_779 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_934 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_193 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_193 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_935 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_579 (Dense)           (None, 128)               65664     
                                                                 
 dense_580 (Dense)           (None, 32)                4128      
                                                                 
 dropout_193 (Dropout)       (None, 32)                0         
                                                                 
 dense_581 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
