Model: "sequential_189"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_166 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_760 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_911 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_761 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_912 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_762 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_913 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_763 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_914 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_189 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_189 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_915 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_567 (Dense)           (None, 128)               65664     
                                                                 
 dense_568 (Dense)           (None, 32)                4128      
                                                                 
 dropout_189 (Dropout)       (None, 32)                0         
                                                                 
 dense_569 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
