Model: "sequential_2"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 separable_conv1d_12 (Separa  (None, 2048, 64)         21504     
 bleConv1D)                                                      
                                                                 
 max_pooling1d_12 (MaxPoolin  (None, 1024, 64)         0         
 g1D)                                                            
                                                                 
 batch_normalization_11 (Bat  (None, 1024, 64)         256       
 chNormalization)                                                
                                                                 
 separable_conv1d_13 (Separa  (None, 1024, 64)         274496    
 bleConv1D)                                                      
                                                                 
 max_pooling1d_13 (MaxPoolin  (None, 512, 64)          0         
 g1D)                                                            
                                                                 
 batch_normalization_12 (Bat  (None, 512, 64)          256       
 chNormalization)                                                
                                                                 
 separable_conv1d_14 (Separa  (None, 512, 128)         1073280   
 bleConv1D)                                                      
                                                                 
 max_pooling1d_14 (MaxPoolin  (None, 256, 128)         0         
 g1D)                                                            
                                                                 
 batch_normalization_13 (Bat  (None, 256, 128)         512       
 chNormalization)                                                
                                                                 
 separable_conv1d_15 (Separa  (None, 256, 128)         2146432   
 bleConv1D)                                                      
                                                                 
 max_pooling1d_15 (MaxPoolin  (None, 128, 128)         0         
 g1D)                                                            
                                                                 
 batch_normalization_14 (Bat  (None, 128, 128)         512       
 chNormalization)                                                
                                                                 
 separable_conv1d_16 (Separa  (None, 128, 32)          143392    
 bleConv1D)                                                      
                                                                 
 max_pooling1d_16 (MaxPoolin  (None, 64, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_15 (Bat  (None, 64, 32)           128       
 chNormalization)                                                
                                                                 
 separable_conv1d_17 (Separa  (None, 64, 32)           35872     
 bleConv1D)                                                      
                                                                 
 max_pooling1d_17 (MaxPoolin  (None, 32, 32)           0         
 g1D)                                                            
                                                                 
 batch_normalization_16 (Bat  (None, 32, 32)           128       
 chNormalization)                                                
                                                                 
 conv1d_2 (Conv1D)           (None, 16, 32)            3104      
                                                                 
 batch_normalization_17 (Bat  (None, 16, 32)           128       
 chNormalization)                                                
                                                                 
 flatten_2 (Flatten)         (None, 512)               0         
                                                                 
 dense_6 (Dense)             (None, 128)               65664     
                                                                 
 dense_7 (Dense)             (None, 32)                4128      
                                                                 
 dropout_2 (Dropout)         (None, 32)                0         
                                                                 
 dense_8 (Dense)             (None, 1)                 33        
                                                                 
=================================================================
Total params: 3,769,825
Trainable params: 3,768,865
Non-trainable params: 960
_________________________________________________________________
