Model: "sequential_139"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_116 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_560 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_661 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_561 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_662 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_562 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_663 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_563 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_664 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_139 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_139 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_665 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_417 (Dense)           (None, 128)               65664     
                                                                 
 dense_418 (Dense)           (None, 32)                4128      
                                                                 
 dropout_139 (Dropout)       (None, 32)                0         
                                                                 
 dense_419 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
