Model: "sequential_136"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_113 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_548 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_646 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_549 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_647 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_550 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_648 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_551 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_649 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_136 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_136 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_650 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_408 (Dense)           (None, 128)               65664     
                                                                 
 dense_409 (Dense)           (None, 32)                4128      
                                                                 
 dropout_136 (Dropout)       (None, 32)                0         
                                                                 
 dense_410 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
