Model: "sequential_135"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_112 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_544 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_641 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_545 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_642 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_546 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_643 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_547 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_644 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_135 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_135 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_645 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_405 (Dense)           (None, 128)               65664     
                                                                 
 dense_406 (Dense)           (None, 32)                4128      
                                                                 
 dropout_135 (Dropout)       (None, 32)                0         
                                                                 
 dense_407 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
