Model: "sequential_141"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_118 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_568 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_671 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_569 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_672 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_570 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_673 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_571 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_674 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_141 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_141 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_675 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_423 (Dense)           (None, 128)               65664     
                                                                 
 dense_424 (Dense)           (None, 32)                4128      
                                                                 
 dropout_141 (Dropout)       (None, 32)                0         
                                                                 
 dense_425 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
