Model: "sequential_140"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_117 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_564 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_666 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_565 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_667 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_566 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_668 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_567 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_669 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_140 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_140 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_670 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_420 (Dense)           (None, 128)               65664     
                                                                 
 dense_421 (Dense)           (None, 32)                4128      
                                                                 
 dropout_140 (Dropout)       (None, 32)                0         
                                                                 
 dense_422 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
