Model: "sequential_134"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_111 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_540 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_636 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_541 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_637 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_542 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_638 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_543 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_639 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_134 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_134 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_640 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_402 (Dense)           (None, 128)               65664     
                                                                 
 dense_403 (Dense)           (None, 32)                4128      
                                                                 
 dropout_134 (Dropout)       (None, 32)                0         
                                                                 
 dense_404 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
