Model: "sequential_138"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_115 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_556 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_656 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_557 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_657 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_558 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_658 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_559 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_659 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_138 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_138 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_660 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_414 (Dense)           (None, 128)               65664     
                                                                 
 dense_415 (Dense)           (None, 32)                4128      
                                                                 
 dropout_138 (Dropout)       (None, 32)                0         
                                                                 
 dense_416 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
