Model: "sequential_143"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_120 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_576 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_681 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_577 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_682 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_578 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_683 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_579 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_684 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_143 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_143 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_685 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_429 (Dense)           (None, 128)               65664     
                                                                 
 dense_430 (Dense)           (None, 32)                4128      
                                                                 
 dropout_143 (Dropout)       (None, 32)                0         
                                                                 
 dense_431 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
