Model: "sequential_150"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_127 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_604 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_716 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_605 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_717 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_606 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_718 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_607 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_719 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_150 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_150 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_720 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_450 (Dense)           (None, 128)               65664     
                                                                 
 dense_451 (Dense)           (None, 32)                4128      
                                                                 
 dropout_150 (Dropout)       (None, 32)                0         
                                                                 
 dense_452 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
