Model: "sequential_145"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_122 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_584 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_691 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_585 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_692 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_586 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_693 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_587 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_694 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_145 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_145 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_695 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_435 (Dense)           (None, 128)               65664     
                                                                 
 dense_436 (Dense)           (None, 32)                4128      
                                                                 
 dropout_145 (Dropout)       (None, 32)                0         
                                                                 
 dense_437 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
