Model: "sequential_148"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_125 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_596 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_706 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_597 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_707 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_598 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_708 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_599 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_709 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_148 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_148 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_710 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_444 (Dense)           (None, 128)               65664     
                                                                 
 dense_445 (Dense)           (None, 32)                4128      
                                                                 
 dropout_148 (Dropout)       (None, 32)                0         
                                                                 
 dense_446 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
