Model: "sequential_149"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_126 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_600 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_711 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_601 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_712 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_602 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_713 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_603 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_714 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_149 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_149 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_715 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_447 (Dense)           (None, 128)               65664     
                                                                 
 dense_448 (Dense)           (None, 32)                4128      
                                                                 
 dropout_149 (Dropout)       (None, 32)                0         
                                                                 
 dense_449 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
