Model: "sequential_144"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_121 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_580 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_686 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_581 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_687 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_582 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_688 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_583 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_689 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_144 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_144 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_690 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_432 (Dense)           (None, 128)               65664     
                                                                 
 dense_433 (Dense)           (None, 32)                4128      
                                                                 
 dropout_144 (Dropout)       (None, 32)                0         
                                                                 
 dense_434 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
