Model: "sequential_146"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_123 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_588 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_696 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_589 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_697 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_590 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_698 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_591 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_699 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_146 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_146 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_700 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_438 (Dense)           (None, 128)               65664     
                                                                 
 dense_439 (Dense)           (None, 32)                4128      
                                                                 
 dropout_146 (Dropout)       (None, 32)                0         
                                                                 
 dense_440 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
