Model: "sequential_147"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_124 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_592 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_701 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_593 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_702 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_594 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_703 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_595 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_704 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_147 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_147 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_705 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_441 (Dense)           (None, 128)               65664     
                                                                 
 dense_442 (Dense)           (None, 32)                4128      
                                                                 
 dropout_147 (Dropout)       (None, 32)                0         
                                                                 
 dense_443 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
