Model: "sequential_182"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_159 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_732 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_876 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_733 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_877 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_734 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_878 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_735 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_879 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_182 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_182 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_880 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_546 (Dense)           (None, 128)               65664     
                                                                 
 dense_547 (Dense)           (None, 32)                4128      
                                                                 
 dropout_182 (Dropout)       (None, 32)                0         
                                                                 
 dense_548 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
