Model: "sequential_184"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_161 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_740 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_886 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_741 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_887 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_742 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_888 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_743 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_889 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_184 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_184 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_890 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_552 (Dense)           (None, 128)               65664     
                                                                 
 dense_553 (Dense)           (None, 32)                4128      
                                                                 
 dropout_184 (Dropout)       (None, 32)                0         
                                                                 
 dense_554 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
