Model: "sequential_186"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_163 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_748 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_896 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_749 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_897 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_750 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_898 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_751 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_899 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_186 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_186 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_900 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_558 (Dense)           (None, 128)               65664     
                                                                 
 dense_559 (Dense)           (None, 32)                4128      
                                                                 
 dropout_186 (Dropout)       (None, 32)                0         
                                                                 
 dense_560 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
