Model: "sequential_183"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_160 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_736 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_881 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_737 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_882 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_738 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_883 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_739 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_884 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_183 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_183 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_885 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_549 (Dense)           (None, 128)               65664     
                                                                 
 dense_550 (Dense)           (None, 32)                4128      
                                                                 
 dropout_183 (Dropout)       (None, 32)                0         
                                                                 
 dense_551 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
