Model: "sequential_180"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_157 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_724 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_866 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_725 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_867 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_726 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_868 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_727 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_869 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_180 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_180 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_870 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_540 (Dense)           (None, 128)               65664     
                                                                 
 dense_541 (Dense)           (None, 32)                4128      
                                                                 
 dropout_180 (Dropout)       (None, 32)                0         
                                                                 
 dense_542 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
