Model: "sequential_178"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_155 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_716 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_856 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_717 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_857 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_718 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_858 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_719 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_859 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_178 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_178 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_860 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_534 (Dense)           (None, 128)               65664     
                                                                 
 dense_535 (Dense)           (None, 32)                4128      
                                                                 
 dropout_178 (Dropout)       (None, 32)                0         
                                                                 
 dense_536 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
