Model: "sequential_181"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_158 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_728 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_871 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_729 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_872 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_730 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_873 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_731 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_874 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_181 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_181 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_875 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_543 (Dense)           (None, 128)               65664     
                                                                 
 dense_544 (Dense)           (None, 32)                4128      
                                                                 
 dropout_181 (Dropout)       (None, 32)                0         
                                                                 
 dense_545 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
