Model: "sequential_152"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_129 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_612 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_726 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_613 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_727 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_614 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_728 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_615 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_729 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_152 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_152 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_730 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_456 (Dense)           (None, 128)               65664     
                                                                 
 dense_457 (Dense)           (None, 32)                4128      
                                                                 
 dropout_152 (Dropout)       (None, 32)                0         
                                                                 
 dense_458 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
