Model: "sequential_156"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_133 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_628 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_746 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_629 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_747 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_630 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_748 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_631 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_749 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_156 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_156 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_750 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_468 (Dense)           (None, 128)               65664     
                                                                 
 dense_469 (Dense)           (None, 32)                4128      
                                                                 
 dropout_156 (Dropout)       (None, 32)                0         
                                                                 
 dense_470 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
