Model: "sequential_151"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_128 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_608 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_721 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_609 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_722 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_610 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_723 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_611 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_724 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_151 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_151 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_725 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_453 (Dense)           (None, 128)               65664     
                                                                 
 dense_454 (Dense)           (None, 32)                4128      
                                                                 
 dropout_151 (Dropout)       (None, 32)                0         
                                                                 
 dense_455 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
