Model: "sequential_153"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_130 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_616 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_731 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_617 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_732 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_618 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_733 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_619 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_734 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_153 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_153 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_735 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_459 (Dense)           (None, 128)               65664     
                                                                 
 dense_460 (Dense)           (None, 32)                4128      
                                                                 
 dropout_153 (Dropout)       (None, 32)                0         
                                                                 
 dense_461 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
