Model: "sequential_154"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_131 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_620 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_736 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_621 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_737 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_622 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_738 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_623 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_739 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_154 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_154 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_740 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_462 (Dense)           (None, 128)               65664     
                                                                 
 dense_463 (Dense)           (None, 32)                4128      
                                                                 
 dropout_154 (Dropout)       (None, 32)                0         
                                                                 
 dense_464 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
