Model: "sequential_155"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 spatial_dropout1d_132 (Spat  (None, 125, 22)          0         
 ialDropout1D)                                                   
                                                                 
 separable_conv1d_624 (Separ  (None, 63, 64)           94400     
 ableConv1D)                                                     
                                                                 
 batch_normalization_741 (Ba  (None, 63, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_625 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_742 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_626 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_743 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 separable_conv1d_627 (Separ  (None, 32, 64)           274496    
 ableConv1D)                                                     
                                                                 
 batch_normalization_744 (Ba  (None, 32, 64)           256       
 tchNormalization)                                               
                                                                 
 conv1d_155 (Conv1D)         (None, 16, 32)            10272     
                                                                 
 flatten_155 (Flatten)       (None, 512)               0         
                                                                 
 batch_normalization_745 (Ba  (None, 512)              2048      
 tchNormalization)                                               
                                                                 
 dense_465 (Dense)           (None, 128)               65664     
                                                                 
 dense_466 (Dense)           (None, 32)                4128      
                                                                 
 dropout_155 (Dropout)       (None, 32)                0         
                                                                 
 dense_467 (Dense)           (None, 1)                 33        
                                                                 
=================================================================
Total params: 1,001,057
Trainable params: 999,521
Non-trainable params: 1,536
_________________________________________________________________
